tap "domt4/autoupdate", "https://github.com/DomT4/homebrew-autoupdate.git"
tap "homebrew/cask"
tap "homebrew/core"
tap "kanidm/kanidm", trusted: true
tap "osx-cross/avr"
tap "rfidresearchgroup/proxmark3", "https://github.com/RfidResearchGroup/homebrew-proxmark3"
tap "terminaloutcomes/handbrakecli", trusted: true
tap "terminaloutcomes/symlinks"
tap "yaleman/proxmark3", trusted: true
tap "ykursadkaya/openlens"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Work with ID3 metadata in .mp3 files
brew "eye-d3"
# Core application library for C
brew "glib"
# Music related metadata search engine with command-line interface and C API
brew "glyr"
# Portable Foreign Function Interface library
brew "libffi"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Better CD Encoder
brew "abcde"
# Run your GitHub Actions locally
brew "act"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Arduino command-line interface
brew "arduino-cli"
# Record and share terminal sessions
brew "asciinema"
# Code searching, linting, rewriting
brew "ast-grep"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Library for communicating with USB and Bluetooth HID devices
brew "hidapi"
# Atmel AVR MCU programmer
brew "avrdude"
# Official Amazon AWS command-line interface
brew "awscli"
# Text-based UI library
brew "ncurses"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Stream processor for mundane tasks written in Go
brew "benthos"
# GNU binary tools for native development
brew "binutils"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# New file format for still image compression
brew "jpeg-xl"
# SDL2 compatibility layer that uses SDL3 behind the scenes
brew "sdl2-compat"
# Roguelike game
brew "brogue"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# CLI tool for analyzing Claude Code usage from local JSONL files
brew "ccusage"
# Generic library support script
brew "libtool"
# CloudFlare's PKI toolkit
brew "cfssl"
# Control Google Chrome from the command-line
brew "chrome-cli"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Malware identification and classification tool
brew "yara"
# Anti-virus software
brew "clamav"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Command-line tool to manage cert-manager
brew "cmctl"
# Up-to-date code documentation for LLMs and AI code editors
brew "context7-mcp"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# List system USB buses and devices
brew "cyme"
# DuckDuckGo from the terminal
brew "ddgr"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Tool for testing and debugging Dependabot update jobs
brew "dependabot"
# USB programmer
brew "dfu-util"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Framework for layout and rendering of i18n text
brew "pango"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Tools for analyzing and visualizing DNS and DNSSEC behavior
brew "dnsviz"
# Command-line DNS client
brew "doge"
# Device tree compiler
brew "dtc"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Convert ELF files to UF2 for USB Flashing Bootloaders
brew "elf2uf2-rs"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Emacs text editor
brew "emacs"
# Charset analyzer and converter
brew "enca"
# AST-based pattern checker for JavaScript
brew "eslint"
# Make creating custom firmwares for ESP32/ESP8266 super easy
brew "esphome"
# ESP8266 and ESP32 serial bootloader utility
brew "esptool"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Audio codec
brew "opus"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast web fuzzer written in Go
brew "ffuf"
# Command-line fuzzy finder written in Go
brew "fzf"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Command-line downloader for image-hosting site galleries and collections
brew "gallery-dl"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Bidirectional operation between a Subversion repository and Git
brew "git-svn"
# Idiomatic, lean, fast & safe pure Rust implementation of Git
brew "gitoxide"
# Alternative to top/htop
brew "glances"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Fast linters runner for Go
brew "golangci-lint"
# Version Control Visualization Tool
brew "gource"
# Like cURL, but for gRPC
brew "grpcurl"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake", link: false
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Full-rich client for the Registry Data Access Protocol (RDAP) sponsored by ICANN
brew "icann-rdap"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Small utility for manipulating IPv6 addresses
brew "ipv6calc"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Command-line pager for JSON data
brew "jless"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Kubernetes YAML to Terraform HCL converter
brew "k2tf"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Compiler for generating binary data parsers
brew "kaitai-struct-compiler"
# Network authentication protocol
brew "krb5"
# Easily check your clusters for use of deprecated APIs
brew "kubent"
# Kubernetes testing according to Hardening Guidance by NSA and CISA
brew "kubescape"
# Postgres C API library
brew "libpq"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# GNOME XML library
brew "libxml2", link: true
# C library for reading, creating, and modifying zip archives
brew "libzip"
# LLM inference in C/C++
brew "llama.cpp"
# Next-gen compiler infrastructure
brew "llvm"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Fast, async, resource-friendly link checker
brew "lychee"
# Text-based web browser
brew "lynx"
# Multiple Arcade Machine Emulator
brew "mame"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "markdownlint-cli2"
# Mac App Store command-line interface
brew "mas"
# TCP port scanner, scans entire Internet in under 5 minutes
brew "masscan"
# Fly through your shell history
brew "mcfly"
# Replacement for ls, cp and other commands for object storage
brew "minio-mc"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple text editor with clickable interface
brew "msedit"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# NCurses Disk Usage
brew "ncdu"
# Single-player roguelike video game
brew "nethack"
# Small build system for use with gyp or CMake
brew "ninja"
# App source + Nix packages + Docker = Image
brew "nixpacks"
# Port scanning utility for large networks
brew "nmap"
# Finds secrets and sensitive information in textual data and Git history
brew "noseyparker"
# Modern shell for the GitHub era
brew "nushell"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# On-chip debugging, in-system programming and boundary-scan testing
brew "open-ocd"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# H.264 codec from Cisco
brew "openh264"
# Development kit for the Java programming language
brew "openjdk@21"
# Tools and libraries for smart cards
brew "opensc"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Simulation game based upon Transport Tycoon Deluxe
brew "openttd"
# PNG file optimizer
brew "optipng"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Middleware to access a smart card using SCard API
brew "pcsc-lite"
# PHP Static Analysis Tool
brew "phpstan"
# Programmer-oriented testing framework for PHP
brew "phpunit"
# Tool for interacting with RP2040/RP2350 devices and binaries
brew "picotool"
# Single-file executable tool for creating, reading and uploading PMTiles archives
brew "pmtiles"
# Optimizer for PNG files
brew "pngcrush"
# Fast, disk space efficient package manager
brew "pnpm"
# Collection of on chip debugging tools to communicate with microchips
brew "probe-rs-tools"
# Monitor data's progress through a pipe
brew "pv"
# Seamless operability between C++11 and Python
brew "pybind11"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Cross-platform application and UI framework
brew "qt"
# Rsync for cloud storage
brew "rclone"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Standard unix software packaging tool
brew "rpm"
# Extremely fast JavaScript and TypeScript linter
brew "rslint"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Safe, concurrent, practical language
brew "rust"
# Modern Day Portscanner
brew "rustscan"
# Rust toolchain installer
brew "rustup"
# SMB/CIFS file, print, and login server for UNIX
brew "samba"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Intuitive find & replace CLI
brew "sd"
# Simple OpenPGP signature verification program
brew "sequoia-sqv"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# HTTP regression testing and benchmarking utility
brew "siege"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Editor of encrypted files
brew "sops"
# Non-interactive SSH password auth
brew "sshpass"
# SQL interface for arbitrary resources with full CRUD support
brew "stackql"
# Cross-shell prompt for astronauts
brew "starship"
# Symbolic link maintenance utility
brew "symlinks"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Terraform Language Server
brew "terraform-ls"
# Tool which checks for the support of TLS/SSL ciphers and flaws
brew "testssl"
# Kubernetes YAML manifests to Terraform HCL converter
brew "tfk8s"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simple TTY terminal I/O application
brew "tio"
# Terminal multiplexer
brew "tmux"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Find and verify credentials
brew "trufflehog"
# Language for application scale JavaScript development
brew "typescript"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Syntax-aware linter for prose
brew "vale"
# Vi 'workalike' with many additional features
brew "vim"
# Next generation frontend tooling. It's fast!
brew "vite"
# Vulkan Header files and API registry
brew "vulkan-headers"
# Web Assembly Binary Toolkit
brew "wabt"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Standalone JIT-style runtime for WebAssembly, using Cranelift
brew "wasmtime"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Convert HTML to PDF
brew "weasyprint"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Convert XML to another format (based on XSL or other tools)
brew "xmlto"
# Command-line XML and HTML beautifier and content extractor
brew "xq"
# Tool to do pattern matching for malware research
brew "yara-x"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Fast static site generator in a single binary with everything built-in
brew "zola"
# Kanidm CLI
brew "kanidm/kanidm/kanidm"
# HandBrake CLI
brew "terminaloutcomes/handbrakecli/handbrakecli", link: false
# RRG/Iceman Proxmark3 client, CDC flasher and firmware bundle
brew "yaleman/proxmark3/proxmark3"
# Image editing and design software
cask "affinity"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Tools for building Android applications
cask "android-studio"
# Multi-track audio editor and recorder
cask "audacity"
# Data backup and storage service
cask "backblaze"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# 3D model slicing software for 3D printers, maintained by Bambu Lab
cask "bambu-studio"
# 3D creation suite
cask "blender"
# Flowchart-based image processing GUI
cask "chainner"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Anthropic's official Claude AI desktop app
cask "claude"
# Semantic code analysis engine
cask "codeql"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Node-based image, video and audio generator
cask "comfy"
# Download and manage your addons and mods
cask "curseforge"
# Server and cloud storage browser
cask "cyberduck"
# Run Stable Diffusion locally
cask "diffusionbee"
# Voice and text chat software
cask "discord"
# Cloud backup tool
cask "duplicacy-cli"
# PCB design tool
cask "easyeda"
# Matrix collaboration client
cask "element"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# Utility to finds and fix problems on computer systems
cask "etrecheckpro"
# Utility for customizing which browser to start
cask "finicky"
# Web browser
cask "firefox"
# Waterfall-style image viewer
cask "flowvision"
cask "font-iosevka"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
# 3D parametric modeller
cask "freecad"
# Software reverse engineering (SRE) suite of tools
cask "ghidra"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# GUI for the Dynamips Cisco router emulator
cask "gns3"
# Web browser
cask "google-chrome"
# Virtual globe
cask "google-earth-pro"
# Tools to protect your emails and files
cask "gpg-suite"
# Open-source video transcoder
cask "handbrake-app"
# Hex editor focussing on speed
cask "hex-fiend"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Vector graphics editor
cask "inkscape"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# End-to-end encryption software
cask "keybase"
# Electronics design automation suite
cask "kicad"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Free and open-source painting and sketching program
cask "krita"
# Kubernetes IDE
cask "lens"
# Discover, download, and run local LLMs
cask "lm-studio"
# Trims video and audio files losslessly
cask "losslesscut"
# Analysis tool for security research and malware triage
cask "mac-monitor"
# Track and update to the latest versions of installed software
cask "macupdater"
# Speech recognition tool
cask "macwhisper"
# Video format converter (transcoder)
cask "makemkv"
# Creats high-quality audio files in various formats, from CDs or files
cask "max"
# Multi-platform web browser
cask "microsoft-edge"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# GameStream client
cask "moonlight"
# Tool for editing metadata of audio files including MP3, FLAC, OGG, and more
cask "mp3tag"
cask "mqtt-explorer"
# Visualiser for neural network, deep learning, and machine learning models
cask "netron"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open source build of Lens Kubernetes IDE
cask "openlens"
# Programmable solid 3D CAD modeller
cask "openscad"
# JDK from Oracle
cask "oracle-jdk"
# Replacement for Docker Desktop
cask "orbstack"
# Application that streams gameplay audio and video from your Playdate
cask "playdate-mirror"
# Collaboration platform for API development
cask "postman"
# Companion app for Flipper Zero devices
cask "qflipper"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Batch image processor
cask "retrobatch"
# Rust IDE
cask "rustrover"
# Instant messaging application focusing on security
cask "signal"
# Video game digital distribution service
cask "steam"
# System calls and log messages analyzer
cask "stratoshark"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Developer experience toolkit used to check, test, merge, and monitor code
cask "trunk-io"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark-app"
# X Certificate and Key management
cask "xca"
# Screenshot tool
cask "xnapper"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Full-featured companion app to the YubiKey
cask "yubico-authenticator"
# Multiplayer code editor
cask "zed"
mas "Bitwarden", id: 1352778147
mas "Brother P-touch Editor", id: 1453365242
mas "Hyperspace", id: 6739505345
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Messenger", id: 1480068668
mas "MQTTAnalyzer", id: 1493015317
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Reolink Client", id: 1086871235
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "Steam Link", id: 1246969117
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "uBlock Origin Lite", id: 6745342698
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "adamhartford.vscode-base64"
vscode "arcsector.vscode-splunk-search-linter"
vscode "arcsector.vscode-splunk-search-syntax"
vscode "astral-sh.ty"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "devmike.mikrotik-routeros-script"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-diff"
vscode "fill-labs.dependi"
vscode "foxundermoon.shell-format"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "henriiik.vscode-perl"
vscode "infosec-intern.yara"
vscode "jacobx1.code-email-pocketknife"
vscode "leathong.openscad-language-support"
vscode "leighlondon.eml"
vscode "mechatroner.rainbow-csv"
vscode "michelemelluso.code-beautifier"
vscode "mkhl.direnv"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vscode.vscode-speech"
vscode "openai.chatgpt"
vscode "opentofu.vscode-opentofu"
vscode "platformio.platformio-ide"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "robbowen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "skellock.just"
vscode "splunk.splunk"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "upstash.context7-mcp"
vscode "vadimcn.vscode-lldb"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/tools/gopls"
go "github.com/google/oss-rebuild/cmd/oss-rebuild"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "bacon"
cargo "brainfuck-rs"
cargo "cargo-audit"
cargo "cargo-auditable"
cargo "cargo-autoinherit"
cargo "cargo-bloat"
cargo "cargo-bump"
cargo "cargo-bundle"
cargo "cargo-careful"
cargo "cargo-crap"
cargo "cargo-criterion"
cargo "cargo-deadlinks"
cargo "cargo-deb"
cargo "cargo-deny"
cargo "cargo-depgraph"
cargo "cargo-deplint"
cargo "cargo-deps"
cargo "cargo-didiuse"
cargo "cargo-diet"
cargo "cargo-edit"
cargo "cargo-expand"
cargo "cargo-generate"
cargo "cargo-libyear"
cargo "cargo-llvm-cov"
cargo "cargo-machete"
cargo "cargo-nextest"
cargo "cargo-outdated"
cargo "cargo-pgo"
cargo "cargo-sweep"
cargo "cargo-tarpaulin"
cargo "cargo-udeps"
cargo "cargo-update"
cargo "cargo-wasi"
cargo "cargo-watch"
cargo "cargo-wizard"
cargo "cargo-zigbuild"
cargo "cherrybomb"
cargo "clean-big-targets"
cargo "clippy-sarif"
cargo "create-tauri-app"
cargo "cross"
cargo "crox"
cargo "diesel_cli"
cargo "dprint"
cargo "du-dust"
cargo "elf2uf2-rs"
cargo "espflash"
cargo "espup"
cargo "fido-mds-tool"
cargo "flamegraph"
cargo "grcov"
cargo "kanidm-profiles"
cargo "kanidm_tools"
cargo "ldproxy"
cargo "loc"
cargo "mdbook"
cargo "mdbook-alerts"
cargo "mdbook-linkcheck"
cargo "mdbook-mermaid"
cargo "mdbook-template"
cargo "miri"
cargo "moonlight-rs"
cargo "pagefind"
cargo "python-sweep"
cargo "ravedude"
cargo "rustfilt"
cargo "rustlings"
cargo "sambot-parser"
cargo "samply"
cargo "sccache"
cargo "sea-orm-cli"
cargo "shrinky-rs"
cargo "splunk"
cargo "starship"
cargo "summarize"
cargo "tauri-cli"
cargo "timeout-cli"
cargo "tokei"
cargo "tokio-console"
cargo "trunk"
cargo "twiggy"
cargo "typos-cli"
cargo "uv-migrator"
cargo "wasm-bindgen-cli"
cargo "wasm-opt"
cargo "wasm-pack"
cargo "wasm-tools"
cargo "wasmphobia"
cargo "watchexec-cli"
cargo "xargo"
cargo "zizmor"
uv "codespell"
uv "openapi-python-client"
npm "@getgrit/cli"
