tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "kanidm/kanidm"
tap "osx-cross/avr"
tap "terminaloutcomes/handbrakecli"
tap "terminaloutcomes/symlinks"
tap "ykursadkaya/openlens"
brew "openssl@3"
brew "eye-d3"
brew "glib"
brew "glyr"
brew "libffi"
brew "python@3.9"
brew "abcde"
brew "act"
brew "brotli"
brew "jpeg-xl"
brew "arduino-cli"
brew "asciinema"
brew "git"
brew "asdf"
brew "ast-grep"
brew "autoconf"
brew "automake"
brew "hidapi"
brew "avrdude"
brew "awscli"
brew "bash"
brew "bat"
brew "benthos"
brew "p7zip"
brew "binwalk"
brew "biome"
brew "libuv"
brew "node"
brew "bitwarden-cli"
brew "sdl2"
brew "brogue"
brew "cairo"
brew "libtool"
brew "cfssl"
brew "chrome-cli"
brew "cloudflared"
brew "cmake"
brew "cowsay"
brew "curl"
brew "cyme"
brew "deno"
brew "dfu-util"
brew "difftastic"
brew "ncurses"
brew "direnv"
brew "dive"
brew "gd"
brew "gdk-pixbuf"
brew "netpbm"
brew "gts"
brew "harfbuzz"
brew "pango"
brew "graphviz"
brew "dnsviz"
brew "dog"
brew "duckdb"
brew "duti"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "enca"
brew "eslint"
brew "esphome"
brew "esptool"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fdupes"
brew "leptonica"
brew "libass"
brew "tesseract"
brew "ffmpeg"
brew "ffuf"
brew "fzf"
brew "gallery-dl"
brew "geckodriver"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "git-lfs"
brew "gitoxide"
brew "glances"
brew "gnupg"
brew "go"
brew "pkgconf"
brew "gobject-introspection"
brew "gobuster"
brew "gource"
brew "handbrake", link: false
brew "helm"
brew "hping"
brew "htop"
brew "hugo"
brew "icann-rdap"
brew "libheif"
brew "imagemagick"
brew "ipcalc"
brew "ipv6calc"
brew "jc"
brew "jless"
brew "jq"
brew "just"
brew "k2tf"
brew "k9s"
brew "krb5"
brew "kubent"
brew "kubescape"
brew "libpq"
brew "libxml2", link: true
brew "libzip"
brew "llama.cpp"
brew "llvm"
brew "lsusb"
brew "lychee"
brew "lynx"
brew "mame"
brew "mas"
brew "masscan"
brew "mcfly"
brew "minio-mc"
brew "mtr"
brew "ncdu"
brew "neofetch"
brew "ninja"
brew "nmap"
brew "noseyparker"
brew "nushell"
brew "nvm"
brew "ollama"
brew "open-ocd"
brew "openapi-generator"
brew "opentofu"
brew "openttd"
brew "optipng"
brew "phpstan"
brew "phpunit"
brew "pipx"
brew "pnpm"
brew "protobuf"
brew "pv"
brew "pybind11"
brew "python@3.10"
brew "python@3.11"
brew "qpdf"
brew "qt"
brew "re2"
brew "ripgrep"
brew "rpm"
brew "rslint"
brew "rust"
brew "rustscan"
brew "rustup"
brew "scc"
brew "sd"
brew "semgrep"
brew "shellcheck"
brew "siege"
brew "sl"
brew "sops"
brew "sshpass"
brew "stackql"
brew "starship"
brew "symlinks"
brew "telnet"
brew "terraform"
brew "terraform-ls"
brew "testssl"
brew "tfk8s"
brew "tflint"
brew "tfsec"
brew "thefuck"
brew "tio"
brew "tldr"
brew "tmux"
brew "trippy"
brew "trivy"
brew "typescript"
brew "uv"
brew "vale"
brew "vault"
brew "vim"
brew "vite"
brew "vulkan-headers"
brew "wasmtime"
brew "watch"
brew "wget"
brew "xmlto"
brew "xq"
brew "yara"
brew "yarn"
brew "yq"
brew "yt-dlp"
brew "zig"
brew "zola"
brew "kanidm/kanidm/kanidm"
brew "terminaloutcomes/handbrakecli/handbrakecli"
cask "affinity-photo"
cask "aldente"
cask "android-studio"
cask "arduino"
cask "audacity"
cask "authy"
cask "backblaze"
cask "balenaetcher"
cask "bambu-studio"
cask "bruno"
cask "chainner"
cask "chatgpt"
cask "chromedriver"
cask "claude"
cask "cyberduck"
cask "diffusionbee"
cask "discord"
cask "duplicacy-cli"
cask "easyeda"
cask "element"
cask "elgato-stream-deck"
cask "etrecheckpro"
cask "firefox"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "freecad"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "google-earth-pro"
cask "gpg-suite"
cask "handbrake"
cask "hex-fiend"
cask "imageoptim"
cask "inkscape"
cask "insomnia"
cask "iterm2"
cask "keybase"
cask "knockknock"
cask "krita"
cask "lens"
cask "lm-studio"
cask "losslesscut"
cask "macupdater"
cask "makemkv"
cask "max"
cask "microsoft-edge"
cask "mitmproxy"
cask "moonlight"
cask "mp3tag"
cask "mqtt-explorer"
cask "netnewswire"
cask "netron"
cask "nextcloud"
cask "ngrok"
cask "obs"
cask "obsidian"
cask "openlens"
cask "oracle-jdk"
cask "orbstack"
cask "playdate-mirror"
cask "postman"
cask "qflipper"
cask "raspberry-pi-imager"
cask "raycast"
cask "rectangle"
cask "red-canary-mac-monitor"
cask "retrobatch"
cask "rustrover"
cask "signal"
cask "steam"
cask "stratoshark"
cask "temurin"
cask "trunk-io"
cask "ultimaker-cura"
cask "visual-studio-code"
cask "vlc"
cask "whisky"
cask "wireshark"
cask "xca"
cask "xquartz"
cask "yubico-authenticator"
cask "zed"
mas "Bitwarden", id: 1352778147
mas "Brother P-touch Editor", id: 1453365242
mas "Hyperspace", id: 6739505345
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Messenger", id: 1480068668
mas "MQTTAnalyzer", id: 1493015317
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Reolink Client", id: 1086871235
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "Steam Link", id: 1246969117
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "Todoist", id: 585829637
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "4ops.terraform"
vscode "adamhartford.vscode-base64"
vscode "anthropic.claude-code"
vscode "arcsector.vscode-splunk-search-linter"
vscode "arcsector.vscode-splunk-search-syntax"
vscode "bierner.markdown-mermaid"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "devmike.mikrotik-routeros-script"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-diff"
vscode "fill-labs.dependi"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "henriiik.vscode-perl"
vscode "jacobx1.code-email-pocketknife"
vscode "leighlondon.eml"
vscode "mechatroner.rainbow-csv"
vscode "michelemelluso.code-beautifier"
vscode "mkhl.direnv"
vscode "mohd-akram.vscode-html-format"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vscode.vscode-speech"
vscode "platformio.platformio-ide"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "robbowen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "skellock.just"
vscode "splunk.splunk"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
