tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "kanidm/kanidm"
tap "osx-cross/avr"
tap "terminaloutcomes/handbrakecli"
tap "turbot/tap"
tap "ykursadkaya/openlens"
brew "python@3.10"
brew "eye-d3"
brew "glib"
brew "glyr"
brew "python@3.9"
brew "brotli"
brew "curl"
brew "abcde"
brew "act"
brew "arduino-cli"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "libtool"
brew "openssl@3"
brew "asdf"
brew "hidapi"
brew "avrdude"
brew "python@3.11"
brew "awscli"
brew "bash"
brew "bat"
brew "node"
brew "pkg-config"
brew "chrome-cli"
brew "cloudflared"
brew "cmake"
brew "deno"
brew "direnv"
brew "gd"
brew "gdk-pixbuf"
brew "netpbm"
brew "harfbuzz"
brew "pango"
brew "dnsviz"
brew "dog"
brew "duti"
brew "protobuf"
brew "esphome"
brew "exa"
brew "exiftool"
brew "unbound"
brew "gnutls"
brew "libarchive"
brew "libass"
brew "ffmpeg"
brew "gallery-dl"
brew "geckodriver"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "handbrake", link: false
brew "helm"
brew "hping"
brew "ncurses"
brew "htop"
brew "hugo"
brew "libheif"
brew "imagemagick"
brew "ipcalc"
brew "ipv6calc"
brew "jc"
brew "jq"
brew "just"
brew "k2tf"
brew "k9s"
brew "libxml2"
brew "llvm"
brew "lsusb"
brew "lychee"
brew "mcfly"
brew "minio-mc"
brew "mtr"
brew "ncdu"
brew "nmap"
brew "openttd"
brew "p7zip"
brew "php"
brew "php-cs-fixer"
brew "phpstan"
brew "phpunit"
brew "pv"
brew "ripgrep"
brew "rpm"
brew "semgrep"
brew "shellcheck"
brew "sl"
brew "sops"
brew "subversion"
brew "symlinks"
brew "telnet"
brew "terraform"
brew "testssl"
brew "tfk8s"
brew "tflint"
brew "thefuck"
brew "tio"
brew "trippy"
brew "vim"
brew "wasmtime"
brew "watch"
brew "wget"
brew "yq"
brew "zola"
brew "kanidm/kanidm/kanidm"
brew "terminaloutcomes/handbrakecli/handbrakecli"
cask "arduino"
cask "audacity"
cask "authy"
cask "backblaze"
cask "balenaetcher"
cask "chromedriver"
cask "cyberduck"
cask "diffusionbee"
cask "discord"
cask "element"
cask "elgato-stream-deck"
cask "firefox"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "ghidra"
cask "gimp"
cask "github"
cask "google-chrome"
cask "gpg-suite"
cask "handbrake"
cask "hex-fiend"
cask "imageoptim"
cask "inkscape"
cask "insomnia"
cask "iterm2"
cask "keybase"
cask "krita"
cask "lens"
cask "lunacy"
cask "makemkv"
cask "max"
cask "microsoft-edge"
cask "mqtt-explorer"
cask "netnewswire"
cask "netron"
cask "nextcloud"
cask "obs"
cask "obsidian"
cask "openlens"
cask "orbstack"
cask "postman"
cask "prusaslicer"
cask "qflipper"
cask "raspberry-pi-imager"
cask "rectangle"
cask "red-canary-mac-monitor"
cask "session-manager-plugin"
cask "signal"
cask "steam"
cask "temurin"
cask "ultimaker-cura"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "xca"
cask "yubico-authenticator"
vscode "adamhartford.vscode-base64"
vscode "arcsector.vscode-splunk-search-linter"
vscode "arcsector.vscode-splunk-search-syntax"
vscode "bungcip.better-toml"
vscode "Catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "DavidAnson.vscode-markdownlint"
vscode "DEVSENSE.composer-php-vscode"
vscode "DEVSENSE.phptools-vscode"
vscode "DEVSENSE.profiler-php-vscode"
vscode "fabiospampinato.vscode-diff"
vscode "GitHub.copilot"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "henriiik.vscode-perl"
vscode "jacobx1.code-email-pocketknife"
vscode "leighlondon.eml"
vscode "michelemelluso.code-beautifier"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-serial-monitor"
vscode "platformio.platformio-ide"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "RobbOwen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "tauri-apps.tauri-vscode"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vsciot-vscode.vscode-arduino"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
